{
  "nombre": "El Faro",
  "objetos": [
    {"objeto":"Cuchillo","detalle":"Encontrado ligeramente doblado, con restos de sangre."},
    {"objeto":"Llave del Faro","detalle":"Llave marcada, podría haber sido usada recientemente."},
    {"objeto":"Zapato roto","detalle":"Encontrado cerca del muelle, posible evidencia de huellas."},
    {"objeto":"Documento antiguo","detalle":"Documento del faro con instrucciones de cierre de seguridad."}
  ],
  "sospechosos": [
    {"nombre":"Sofia","resumen":"Trabajadora del faro, conoce bien la zona y tiene relación cercana con Mateo."},
    {"nombre":"Mateo","resumen":"Ayudante del faro, siempre atento a la torre, amigo de Sofia."},
    {"nombre":"Lucas","resumen":"Guardia nocturno, celoso y reservado, conocía los objetos de valor del faro."},
    {"nombre":"Clara","resumen":"Fotógrafa visitante, curiosa y observadora, estuvo en la zona esa noche."},
    {"nombre":"Javier","resumen":"Historiador, interesado en documentos antiguos y en la historia del faro."},
    {"nombre":"Ricardo","resumen":"Nuevo sospechoso descubierto durante la investigación, visitante desconocido que rondaba el muelle."}
  ],
  "preguntasBasicas": {
    "Sofia":[
      {"texto":"¿Con quién estabas la noche del crimen?","respuesta":"Estaba sola revisando la torre y asegurando el faro; Mateo estuvo conmigo solo unos minutos antes de retirarse. Más tarde escuché pasos desconocidos."},
      {"texto":"¿Qué hora estabas en el faro?","respuesta":"Llegué a las 21:00 y me retiré a las 23:30, observando movimientos extraños cerca del muelle."},
      {"texto":"¿Viste algún objeto fuera de lugar?","respuesta":"Sí, noté que el cuchillo estaba fuera de su lugar habitual, doblado y con sangre."}
    ],
    "Mateo":[
      {"texto":"¿Qué hacías durante la noche del crimen?","respuesta":"Inspeccionaba los niveles inferiores. Observé a Clara tomando fotos y a alguien desconocido rondando."},
      {"texto":"¿Alguien te siguió?","respuesta":"Sí, noté una sombra cerca del muelle, parecía un visitante desconocido."}
    ],
    "Lucas":[
      {"texto":"¿Dónde estabas la noche del crimen?","respuesta":"Patrullaba el muelle y revisaba la cerradura del faro. Noté sombras sospechosas detrás del faro."}
    ],
    "Clara":[
      {"texto":"¿Qué hacías esa noche?","respuesta":"Fotografiaba el faro y alrededores. Vi a Mateo y Lucas moverse cautelosamente."}
    ],
    "Javier":[
      {"texto":"¿Qué observaste en el faro?","respuesta":"Exploraba los niveles superiores. Vi movimientos extraños y sombras detrás del faro."}
    ],
    "Ricardo":[
      {"texto":"¿Qué hacías en el muelle?","respuesta":"Solo pasaba por el muelle, pero vi cómo Lucas y Mateo se movían nerviosos. No interactué con nadie."}
    ]
  },
  "preguntasAvanzadas": {
    "Sofia":[
      {"texto":"¿Quién podría ser el nuevo sospechoso?","respuesta":"Era alguien vestido de oscuro, moviéndose sigilosamente. Esto añade a Ricardo como sospechoso.","desbloqueo":[{"sospechoso":"Ricardo","nuevaPregunta":"¿Quién eres y qué hacías cerca del muelle?"}]},
      {"texto":"¿Notas algo extraño sobre Lucas?","respuesta":"Parecía nervioso cerca de la cerradura, contradiciendo su declaración inicial.","desbloqueo":[{"sospechoso":"Lucas","nuevaPregunta":"¿Por qué estabas nervioso cerca de la cerradura?"}]},
      {"texto":"¿Qué escuchaste en la torre?","respuesta":"Escuché murmullos y pasos rápidos, lo que indica actividad sospechosa."}
    ],
    "Mateo":[
      {"texto":"¿Qué hiciste al ver al intruso?","respuesta":"Intenté observar sin ser notado, confirmando que hay un nuevo sospechoso.","desbloqueo":[{"sospechoso":"Ricardo","nuevaPregunta":"¿Por qué estabas rondando el muelle?"}]}
    ],
    "Lucas":[
      {"texto":"¿Quién podría ser el intruso?","respuesta":"No puedo identificarlo, pero sus movimientos indican que conocía los horarios de vigilancia.","desbloqueo":[{"sospechoso":"Ricardo","nuevaPregunta":"¿Qué estabas haciendo en el muelle esa noche?"}]},
      {"texto":"¿Qué pasó con el cuchillo?","respuesta":"El cuchillo estaba doblado y con sangre, confirma participación en el crimen."}
    ],
    "Clara":[
      {"texto":"¿Qué notaste sobre el intruso?","respuesta":"Se movía con cuidado, evitando ser visto. Esto confirma a Ricardo como sospechoso."}
    ],
    "Javier":[
      {"texto":"¿Qué observaste sobre las sombras?","respuesta":"Parecían planear algo, indicando que hay un sospechoso adicional en el muelle."}
    ],
    "Ricardo":[
      {"texto":"¿Quién te vio en el muelle?","respuesta":"Vi a varios sospechosos pero no interactué. Esto confirma contradicciones y nuevas pistas."}
    ]
  },
  "resolucion": {
    "culpable":"Lucas",
    "complice":"Mateo",
    "arma":"Cuchillo",
    "motivo":"Protección del Faro"
  }
}
