{
  "nombre": "El Faro",
  "sospechososIniciales": ["Sofia","Mateo","Lucas","Clara","Javier"],
  "objetos": [
    {"objeto":"Cuchillo","detalle":"Encontrado ligeramente doblado, con restos de sangre en la empuñadura y hoja."},
    {"objeto":"Llave del Faro","detalle":"Llave metálica con marca de uso reciente; no corresponde al llavero general."},
    {"objeto":"Zapato roto","detalle":"Zapato masculino, suela desgastada y lazo roto; huellas parciales en la arena."},
    {"objeto":"Documento antiguo","detalle":"Documento con anotaciones sobre accesos y cierre nocturno; alguien lo había hojeado recientemente."}
  ],
  "sospechosos": [
    {"nombre":"Sofia","resumen":"Trabajadora del faro, responsable de cierres. Conoce horarios y llaves."},
    {"nombre":"Mateo","resumen":"Ayudante, hace tareas en la torre. Cercano a Sofia."},
    {"nombre":"Lucas","resumen":"Guardia nocturno, celoso de la víctima y conocedor del almacén de herramientas."},
    {"nombre":"Clara","resumen":"Fotógrafa; pasó la noche tomando imágenes para su proyecto."},
    {"nombre":"Javier","resumen":"Historiador; investiga documentos del faro y pistas antiguas."},
    {"nombre":"Ricardo","resumen":"Visitante desconocido; observado fugazmente en el muelle (sospechoso desbloqueable)."}
  ],
  "preguntasBasicas": {
    "Sofia": [
      {"texto":"¿Con quién estabas la noche del crimen?","respuesta":"Al principio con Mateo en la torre. Más tarde estuve sola hasta las 23:30. Escuché pasos y vi una sombra moverse por el muelle."},
      {"texto":"¿Qué hora llegaste y te fuiste del faro?","respuesta":"Llegué a las 20:50 para el cierre y me fui a las 23:30 tras comprobar las cerraduras."},
      {"texto":"¿Viste algún objeto fuera de lugar?","respuesta":"Sí: noté un cuchillo fuera de su sitio y algo de sangre en la mesa de la cocina."}
    ],
    "Mateo": [
      {"texto":"¿Qué hacías durante la noche del crimen?","respuesta":"Inspeccionaba los niveles inferiores y reparaba una lámpara. Vi a alguien extraño a lo lejos, parecía observarnos."},
      {"texto":"¿Alguien te siguió?","respuesta":"Sentí que alguien me observaba desde la oscuridad del muelle; no logré identificarle claramente."},
      {"texto":"¿Notaste algo en el suelo?","respuesta":"Encontré un zapato roto cerca del muelle, con arena fresca alrededor."}
    ],
    "Lucas": [
      {"texto":"¿Cuál era tu ronda esa noche?","respuesta":"Patrullaba el muelle y revisaba el área de almacenaje. Vi a Mateo bajar a niveles inferiores y luego noté movimiento en la cocina."},
      {"texto":"¿Viste a alguien junto a la cerradura?","respuesta":"No estuve junto a la cerradura cuando se movió, pero noté que alguien pasó junto a ella con prisa."}
    ],
    "Clara": [
      {"texto":"¿Qué hacías esa noche en el faro?","respuesta":"Tomaba fotografías nocturnas. Vi a Lucas y Mateo moverse con cautela y algo parecía fuera de sitio—un cuchillo en la mesa."}
    ],
    "Javier": [
      {"texto":"¿Qué investigabas en el faro?","respuesta":"Buscaba planos antiguos. Vi sombras en la cubierta superior y alguien hojeando documentos que no eran míos."}
    ],
    "Ricardo": [
      {"texto":"¿Qué hacías en el muelle?","respuesta":"Pasaba por el muelle por curiosidad. No quería problemas; solo observaba desde la distancia."}
    ]
  },
  "preguntasAvanzadas": {
    "Sofia": [
      {"texto":"¿Quién crees que podría haber usado la llave fuera de horario?","respuesta":"Lucas parecía demasiado pendiente de las llaves y del almacén; le vi revisar objetos personales cerca de la mesa después del cierre.","requires":["¿Viste algún objeto fuera de lugar?"],"desbloqueo":[{"sospechoso":"Lucas","nuevaPregunta":"¿Por qué revisabas objetos cerca de la mesa tras el cierre?","respuesta":"Estaba comprobando que nada faltara del almacén; no toqué el cuchillo."}]},
      {"texto":"¿Escuchaste voces cerca del muelle?","respuesta":"Sí: murmullos apagados y pasos que se alejaban; alguien conocía la zona y no parecía turista.","requires":["¿Con quién estabas la noche del crimen?"],"desbloqueo":[{"sospechoso":"Ricardo","nuevaPregunta":"¿Por qué estabas merodeando el muelle?","respuesta":"Solo estaba pasando; me llamó la atención una luz extraña."}]},
      {"texto":"¿Dónde viste la sangre inicialmente?","respuesta":"En la mesa de la cocina, cerca del cajón donde se guardan herramientas; fue lo que me alarmó y me hizo llamar a Lucas."}
    ],
    "Mateo": [
      {"texto":"¿Qué hiciste cuando viste el zapato roto?","respuesta":"Marqué su ubicación y fui a avisar a Sofia. La suela estaba con arena reciente, como si hubieran huido hacia el muelle.","requires":["¿Notaste algo en el suelo?"],"desbloqueo":[{"sospechoso":"Ricardo","nuevaPregunta":"¿Tenías zapatos mojados o rotos esa noche?","response":"No, los míos estaban bien."}]},
      {"texto":"¿Viste a alguien pasar apresurado?","respuesta":"Sí, a una figura oscura pasar junto a la cocina en dirección al muelle; parecía conocer los accesos."}
    ],
    "Lucas": [
      {"texto":"¿Qué hiciste en la cocina tras la alarma?","respuesta":"Recogí el cuchillo y lo aseguré; estaba doblado y con manchas que parecían sangre, por eso lo llevé a un lugar seguro.","requires":["¿Cuál era tu ronda esa noche?"],"desbloqueo":[{"sospechoso":"Javier","nuevaPregunta":"¿Ves relación entre los documentos y la escena de la cocina?","response":"Los documentos tenían anotaciones recientes que hablaban de accesos; alguien los había mirado."}]},
      {"texto":"¿Por qué estabas tan pendiente del almacén?","respuesta":"Porque en los últimos días han desaparecido pequeñas herramientas; yo vigilaba que no faltara nada."}
    ],
    "Clara": [
      {"texto":"¿Qué notaste en tus fotos relevante para el caso?","respuesta":"En una foto se ve a una figura a la distancia junto al muelle y en otra, una sombra que entra en la cocina; si se amplía quizá veamos rasgos."}
    ],
    "Javier": [
      {"texto":"¿Qué documento pareció haber sido manipulado?","respuesta":"Un cuaderno con apuntes sobre cierres; alguien había desplegado hojas con anotaciones recientes y marcas de dedos."}
    ],
    "Ricardo": [
      {"texto":"¿Por qué estabas rondando el muelle?","respuesta":"Me interesaba ver el faro por la noche; vi movimientos y me alejé. No hablé con nadie.", "initiallyHidden": true}
    ]
  },
  "resolucion": {
    "culpable":"Lucas",
    "complice":"Mateo",
    "arma":"Cuchillo",
    "motivo":"Protección del Faro"
  }
}